[
    {
        "name": "Access Futures Club",
        "description": "\r\n    Spreading awareness of the disabilities that many face, how we over come them, the services available, and the power of allyship.\r\n"
    },
    {
        "name": "African Student Union",
        "description": "\r\n    Our Mission is to Educate, Uplift and Inspire the CCNY student body on the Issues and Realities of Africa as well as the African Diaspora on and off campus. We also want to unite members of the African Diaspora and student body on campus.\r\n"
    },
    {
        "name": "Alpha Phi Alpha Fraternity, Inc",
        "description": "\r\n    Alpha Phi Alpha Fraternity, Inc. develops leaders, promotes brotherhood and academic excellence, while providing service and advocacy for our communities.\r\n"
    },
    {
        "name": "American Institute of Architecture Students (AIAS)",
        "description": "\r\n    The American Institute of Architecture Students (AIAS) is an independent, nonprofit, student-run organization dedicated to advancing leadership, design, and service among architecture students.\r\n"
    },
    {
        "name": "American Medical Women's Association in the City College of New York",
        "description": "\r\n    The American Medical Women’s Association (AMWA) is a national organization made of female physicians and medical students. The organization focuses on the advancement of women in medicine despite the many hardships and challenges women face on their road to a career in medicine. As an undergraduate chapter of AMWA at the City College of New York, we hope to keep AMWA’s national goals of health equity and excellence alive, along with providing a space for pre-med students on CCNY’s campus to come together and support each other through their medical journeys. We will also work with the graduate chapter of AMWA through the medical students in the CUNY School of Medicine. As a club we hope to have events and meetings that promote the advancement of the females on our campus. This will be done through networking, social justice and volunteering events like fundraising. We hope that you join or support us in the fall of 2022!!\r\n"
    },
    {
        "name": "American Society of Civil Engineers",
        "description": "\r\n    The American Society of Civil Engineers, the oldest national professional engineering society, was founded in 1852 with an objective to enhance the welfare of humanity by advancing the science and profession of civil engineering. More than 150,000 individual ASCE members are engaged in engineering education, research, public agency, industrial, construction, and private engineering practice.\r\n"
    },
    {
        "name": "Association for Computing Machinery",
        "description": "\r\n    The Association of Computing Machinery Chapter at CCNY aims to foster a community of Computer Science/Engineering students and tech enthusiasts who collaborate in developing the skills needed in the industry, expanding their network, participating in activities (networking events, workshops, panels, and competitions) related to new technologies, and learning how to further their professional careers.\r\n"
    },
    {
        "name": "Badminton Club",
        "description": "\r\n    Our goal is to provide a welcoming environment for anyone interested in playing badminton. Whether you are picking up a racket for the first time or are a seasoned veteran of the sport. Our club is built of the students to so can lose some stress and anxiety from long classes, and works.\r\n"
    },
    {
        "name": "Bangladesh Student Association of City College of New York",
        "description": "\r\n    The purpose of BSA CCNY is to communicate and unite all Bangladeshi continuing students and Alumni from the City College of New York (CCNY). Our goal is to practice culture and traditions to represent the country by unifying the Bangladeshi students of CCNY. Also help our members by sharing: information's of jobs/internships/work-study, text-books, class-notes, campus-info. To help choosing the right class with the right professor, and last but not the least to aid Bangladesh in any disastrous condition.\r\n"
    },
    {
        "name": "Be The Match",
        "description": "\r\n    Be The Match is a non-profit organization. Their goal is to help patients who have blood cancers and life threatening diseases. BTM has the world's largest marrow donor registry. Only 4% of the swabs in their banks come from African Americans. Patients are more likely to match with someone of their same ethnicity, which is why it is crucial to grow and diversify the registry. You can help by educating your community on the need for more donors and inspiring them to join the registry. Help us to fundraise for patients who are financially burdened, signup and receive a swab kit, join the registry under our Team.\r\n"
    },
    {
        "name": "Beta Beta Beta Honor Society",
        "description": "\r\n    The main purpose of the Beta Beta Beta (TriBeta) Honor Society is to give students who are majoring in Biology, along with other science majors, opportunities to advance themselves in both knowledge and future career paths. The TriBeta chapter on the City College of New York campus allows STEM majors to have access to mentors and potentials for research in their field of interest. One of the foundations of TriBeta is for its members to share their knowledge with as many people as possible. Therefore, TriBeta partners with the BIOS Journal of Biology to encourage their members to both engage in and publish research.\r\n"
    },
    {
        "name": "Biomedical Asian Health Coalition",
        "description": "\r\n    BAHC is part of the Asian Pacific American Medical Student Association (APAMSA). APAMSA is national organization devoted to bringing together Asians and others interested in the health issues that affect Asians in order to have a strong collective public and political voice. BAHC, an undergraduate club at CCNY, has brought this mission home to the Sophie Davis community since its founding in 1995. BAHC has been bringing both students and faculty together for years through events such as Sports Nite, International Night, Game Night and SING! Over the years, BAHC has become to be known as a club dedicated to social events. Now, we plan to continue with APAMSA’s mission by giving back to the community by working with charities through fundraisers and volunteering while continuing to bring the Sophie Davis community together.\r\n"
    },
    {
        "name": "Biomedical Engineering Society",
        "description": "\r\n    Our mission is to create both a social and academic environment for any student who is interested in combining engineering principles with modern-day medicine. We hold several social and educational events to unify students with these interests and offer them several opportunities to learn about the broad field that is biomedical engineering.\r\n"
    },
    {
        "name": "Biotechnology Club",
        "description": "\r\n    The Biotechnology Club at CCNY hopes to foster a community of individuals who have an interest in biotechnology and who would like to pursue a career path in the field. Our club caters to all career paths in the field including business, medicine, research, and engineering. Through out the course of the academic year, we seek to invite a wide range of speakers from across the country who have a prominent role in the field. Through them, we learn about the innovations occurring in the field and how we should go about our own interests.\r\n"
    },
    {
        "name": "Black Student Union",
        "description": "\r\n    The Black Student Union seeks to create a safe space to foster cultural and academic excellence for the Black students of City College.\r\n"
    },
    {
        "name": "Caribbean Students' Association",
        "description": "\r\n    The purpose of the organization will be: 1. To encourage and promote cultural exchange, and foster social and intellectual interaction among Caribbean students. 2. To promote a better mutual understanding and purposeful relationship with the Harlem, New York City area. 3. To develop interaction and promote understanding with other student organizations in and around the City College of New York. 4. To facilitate communication between the Caribbean students of the university and other Caribbean organizations.\r\n"
    },
    {
        "name": "CCNY Amateur Radio Society",
        "description": "\r\n    Our club strives to give the CCNY community a place to discover the hobbies Amateur Radio has to offer, as well as its ties to today's STEM focus.\r\n"
    },
    {
        "name": "CCNY Arts and Crafts",
        "description": "\r\n    The purpose of this club is to promote an artistic social environment for students to express their abilities, expand their knowledge and be part of the art community.\r\n"
    },
    {
        "name": "CCNY Association for Women in Mathematics",
        "description": "\r\n    The purpose of the Association for Women in Mathematics is to create a community in which women and girls can thrive in their mathematical endeavors, and to promote equitable opportunity and treatment of women and others of marginalized genders and gender identities across the mathematical sciences.\r\n"
    },
    {
        "name": "CCNY Circle K",
        "description": "\r\n    CCNY Circle K is a club that promotes community service, fellowship and leadership. The organization is associated with Kiwanis International, which is a global organization of volunteers. This is a great opportunity to not only be involved with such a great organization but also to grow as an individual. In addition, it often works with other Circle K International clubs in New York State. Each year, there are three opportunities to to attend conferences with the rest of the New York District: District Large Scale Service Project, New York Speaking, and District Convention. CCNY Circle K hopes to provide numerous volunteer service events for CCNY students. Unlike other service organizations, which often focus on one particular cause, Circle K is willing to volunteer for any and every cause! If a member is interested in volunteering for a certain cause, they can contact the club which will do whatever it can to encourage club volunteering at any worthy cause.\r\n"
    },
    {
        "name": "CCNY Dream Team",
        "description": "\r\n    The CCNY Dream Team is a student club dedicated to cultivating a safe space for immigrant groups at City College of New York to feel supported and welcomed. We are an undocumented student led club providing support and resources to the undocumented community on campus through information, resources, political engagement, and inspiration.\r\n"
    },
    {
        "name": "CCNY Green",
        "description": "\r\n    We are a club, a collaborative, design-built effort to generate food and educate the community on food & ecological issues! We strive to involve students in sustainable, eco-friendly activities. Our goal is to create a fun, educational environment at the Roofpod of the Spitzer School of Architecture. We hope to improve our growing RoofPod garden of flowers, vegetables, and herbs with the help of the CCNY community.\r\n"
    },
    {
        "name": "CCNY Knitting Club",
        "description": "\r\n    We are a community of people that are passionate about the art of making. We primarily focus on knitting but welcome makers of all kinds. We're always willing to help people learn and grow within the craft.\r\n"
    },
    {
        "name": "CCNY Pre-Law Club",
        "description": "\r\n    The CCNY Pre-Law Club functions to provide a safe and interactive environment for like-minded students to grow personally, academically and professionally. We hope to foster understanding, learning, and appreciation of law in all of its forms in our community. Our club is geared towards exposing students from any major to various legal careers. We aim to have workshops and events with guest speakers from an array of fields including but not limited to environmental, criminal, policy making, health etc. As not all legal occupations require an individual to attend law school, we provide an interactive and engaging space where students can discover their interests and passions.\r\n"
    },
    {
        "name": "CCNY Public Relations Student Society Of New York (CCNY PRSSA)",
        "description": "\r\n    The Public Relations Student Society of America (PRSSA) is a pre-professional organization for college students interested in a career in communications at The City College of New York. Overall, it's a community ready to support you through the Ad/PR program and help you access exclusive opportunities!\r\n"
    },
    {
        "name": "CCNY Robotics Club",
        "description": "\r\n    The CCNY Robotics Club aims to provide engineering students with the hands-on mechanical, electrical and computer engineering experience to apply their knowledge to real world projects. We host annual workshops, such as the Arduino and Solidworks workshops. These workshops provide new members and students the opportunity to start with the basics. We have also hosted numerous industry roundtables, academic sessions, and entertainment events. In recent years the club has had its greatest focus on a variety of team robotics projects, which have given many students their first experience in working together on real-life design and manufacturing tasks. The club has also been a source of guidance, information, and advice for students while they are working on various classes and extracurricular projects.\r\n"
    },
    {
        "name": "CCNY Women's Robotics Club",
        "description": "\r\n    Women's Robotics Club is an initiative to increase the number of women in the STEM field by exposing them to robotics-related projects, internships, and different careers available within the technology industry. We hope to assist them on their journey to become independent and innovative leaders. We will promote and increase the confidence/knowledge of women in this male-dominated field.\r\n"
    },
    {
        "name": "Chabbad at CCNY",
        "description": "\r\n    The goals of Chabad at CCNY is to allow for Jewish Life on the CCNY campus. We would like to create an atmosphere where Jewish students can feel comfortable and gain knowledge of their heritage. We are here to make sure that the Jews and other members of any clubs feel comfortable with the Jewish culture on campus.\r\n"
    },
    {
        "name": "Chinese Students & Scholars Association",
        "description": "\r\n    This club's purpose is to create a platform for the Chinese social community in CCNY to know each other, and to help with any academic problems. We also arrange events for members to meet each other and have fun together.\r\n"
    },
    {
        "name": "City Chaahat",
        "description": "\r\n    City Chaahat is a student-run dance team that specializes in the fusion of various dance styles, including Bollywood, Hip-Hop, Contemporary, etc. Founded in 2011 by a handful of passionate young dancers, this group has upheld its original purpose of showcasing South Asian culture through the sport of dance on the campus of City College of New York (CCNY). Today, this diverse dance group has grown to just over 13 talented members ranging from college freshmen to seniors – some of whom have professionally danced before and many of whom are beginners! These dancers continue to make choreography and are constantly looking for innovative ways to spice up their dance routines!\r\n"
    },
    {
        "name": "City Honors' Illustrious Mentorship Program (CCNY CHiMP)",
        "description": "\r\n    To focus on the welfare and transition of incoming freshmen Honors and Macaulay Honors students into the City College of New York.\r\n"
    },
    {
        "name": "Climb CCNY",
        "description": "\r\n    The purpose of this organization is to introduce, teach, and encourage students in the sport of rock climbing. We seek to establish a safe and fun learning environment that will accommodate athletes of any level. There will be opportunities available for more advanced experiences should students wish to pursue the sport competitively which would be outside the scope of the club. We hope to engage students both with their fitness and their relationship to nature. Our goal is to get people moving and bring students together in a communal sport without judgment. We hope to grow an expansive climbing community at City College of New York.\r\n"
    },
    {
        "name": "Crescent Moon Dance",
        "description": "\r\n    Crescent Moon's mission is to create a safe and positive environment in which we can spread mutual interests in Korean culture, especially Korean pop music. With our team, we want to build a solid dance crew to film public covers, performance videos, activity-based dance content, and even original choreography. No prior dance background is necessary to join!\r\n"
    },
    {
        "name": "Cru/Epic Movement",
        "description": "\r\n    We are a family of people who have been transformed by Jesus. We believe He can bring healing to our relationships, our campus, our city, and our country (and our world). Because of this, we want to provide a place for people to explore and grow in their faith, and to better understand how what Jesus taught matters for everyone today.\r\n"
    },
    {
        "name": "Delta Phi Omega Sorority Inc.",
        "description": "\r\n    The purpose of Delta Phi Omega shall be to foster unity among South Asian women, build community awareness, and gain a greater understanding of oneself and others. The sorority aspires to instill leadership traits, excel in all academic endeavors, to encourage an active relationship between the sorority and its respective university, and shall do so with the utmost compassion, dignity, and fortitude.\r\n"
    },
    {
        "name": "Delta Sigma Theta Sorority, Inc. - Epsilon Tau Chapter",
        "description": "\r\n    Delta Sigma Theta Sorority, Incorporated, is an organization of college-educated women committed to the constructive development of its members and to public service with a primary focus on the Black community.\r\n"
    },
    {
        "name": "Doctors With Dīn",
        "description": "\r\n    The purpose of this club is to spread the beauty and principles of Islam while creating an opportunity for pre-med students to incorporate their faith into their current schedules and future careers. Overall, the club strives to spread the principles of Islam while providing a safe space for students to discuss and learn more about the religion.\r\n"
    },
    {
        "name": "Dominican Students Association",
        "description": "\r\n    The Dominican Students Association is a club on campus that recognizes, educates, and celebrates Dominican Culture. We aim to build a family of anyone interested in Dominican Culture.\r\n"
    },
    {
        "name": "Financial Literacy & Stock Market Club",
        "description": "\r\n    We will be opening students' eyes to the real possibilities of the Stock Market, as well as teaching vital Financial Literacy Skills that will help students after graduation, and even while they attend college @ CCNY. We have a broad & strong vision with this club: to change student lives financially, by teaching them 'how to fish' in our free-market economy.\r\n"
    },
    {
        "name": "Future Architects of the Middle East",
        "description": "\r\n    Future Architects of the Middle East is an organization dedicated to celebrating historical and modern contributions by Asian artists, activists, and architects to the global community, with a focus on the Middle East.\r\n"
    },
    {
        "name": "Girls Who Code College Loops",
        "description": "\r\n    Girls Who Code aims to provide a space for women on campus to learn to code and explore the vast field that is technology through workshops, speaker events, and additional opportunities and resources!\r\n"
    },
    {
        "name": "Global Brigades",
        "description": "\r\n    Global Brigades is an international organization that provides volunteer opportunities in different countries to help resolve health and economic disparities with local staff and communities.\r\n"
    },
    {
        "name": "Harlem Launch Alliance",
        "description": "\r\n    The Harlem Launch Alliance club is a club that does all things rocketry. Our members build low power and high-power amateur rockets and get certifications to launch rockets with the relevant rocketry organizations. Additionally our teams work with experts in the amateur rocketry field to design our own flight computers, rocket bodies, engines, and motors. We have a robust education program designed to teach anyone from any major with any level of experience the basics of rocketry and help them progress onto our specialized experimental rocketry teams.\r\n"
    },
    {
        "name": "Hillel at City College",
        "description": "\r\n    Hillel at City College is a home away from home for Jewish students since its founding in 1946. We offer Jewish programming, Israel education, and social opportunities in order to build a Jewish community at CCNY.\r\n"
    },
    {
        "name": "Humanizing Club at CCNY",
        "description": "\r\n    We aim to deteriorate the growing social stigma that surrounds homelessness in Harlem, and on a grander scale in America. Many people believe that those who are homeless have no motivation to better themselves and deserve their position in society. We, however, disagree and believe that not all homeless people deserve to be relegated to such a low standard. We want to give a voice to those who are voiceless, and more than anything else, desire to actively make a difference in our local community. We hope to garner support and increase our membership on the City College campus. Our aim is to provide students with an opportunity to give back to their community that is not only selfless but also enriching.\r\n"
    },
    {
        "name": "Institute of Electrical and Electronics Engineers",
        "description": "\r\n    Our club works to connect electrical engineering students with other students, alumni, and staff in order to create an environment where we connect with each other and help each other along our individual paths. Our club has many specific events that are both electrical engineering concept based or professional development based.\r\n"
    },
    {
        "name": "InterVarsity Christian Fellowship (IVCF)",
        "description": "\r\n    Our IVCF community strives to show God’s love, we commit to building a community of every ethnicity & culture who follows Jesus and loves beyond all measures.\r\n"
    },
    {
        "name": "InterVarsity Christian Fellowship (IVCF) - Sophie Davis",
        "description": "\r\n    In response to God's love, grace, and truth: The purpose of Sophie Davis InterVarsity Christian Fellowship is to establish and advance at Sophie Davis College witnessing communities of students and faculty who follow Jesus as Savior and Lord, growing in love for God, God's Word, God's people of every ethnicity and culture, and God's purposes in the world.\r\n"
    },
    {
        "name": "Iota Nu Delta Fraternity, Inc.",
        "description": "\r\n    Iota Nu Delta uplifts its men in their duties: to serve, to lead, and to accomplish greater things in life. Bound by Brotherhood Eternal, we shall: 1.Cultivate lifelong academic and professional excellence. 2.Extend meaningful service to humanity and leadership in society. 3.Promote understanding of the diverse South Asian cultures.\r\n"
    },
    {
        "name": "Latino Medical Student Association( LMSA) Plus",
        "description": "\r\n    The purpose of this club is to try and help improve the pipeline for underrepresented minorities, specifically Latinx students going to medical school. We also want to give undergraduates the opportunity to be able to meet current medical students and hopefully initiate mentoring opportunities. This chapter will provide undergraduate pre-med students with the opportunity to be part of the organization Latino Medical Students Association (LMSA) which they can call their own.\r\n"
    },
    {
        "name": "Medical Roots Project",
        "description": "\r\n    The Medical Roots Project is a not-for-profit organization developed to demystify and refine personal healthcare. Created to empower citizens to take their health and healing into their own hands. Club members will participate in community education, community service and awareness events on campus and off campus.\r\n"
    },
    {
        "name": "Model United Nations",
        "description": "\r\n    The Model United Nations club is a space for students to talk about global issues they feel passionate about and participate in annual conferences to enhance their public speaking and research skills with students from around the world.\r\n"
    },
    {
        "name": "Muslim Students' Organization",
        "description": "\r\n    To enhance the Muslim community on campus.\r\n"
    },
    {
        "name": "Muslims Giving Back CCNY",
        "description": "\r\n    We are a student organization at CCNY based on the non-profit organization, Muslims Giving Back (MGB), which is dedicated to upholding the true image of Islam through action and community service. Regardless of religion/race/ethnicity, everyone is welcome to join MGB CCNY in helping those in need!\r\n"
    },
    {
        "name": "National Association for the Advancement of Colored PeopleUndergraduate Chapter",
        "description": "\r\n    NAACP is a national organization that works towards “ensuring a society in which all individuals have equal rights without discrimination based on race.” This is accomplished by hosting different events that cater to the following game changers: federal advocacy, environmental justice, health, criminal justice, economic sustainability, and education.\r\n"
    },
    {
        "name": "National Society of Black Engineers CCNY Chapter",
        "description": "\r\n    To increase the number of culturally responsible black engineers who excel academically succeed professionally and positively impact the community.\r\n"
    },
    {
        "name": "Nepalese Student Association",
        "description": "\r\n    NSA club focuses on providing opportunities for ambitious Nepali students who are dedicated to improving themselves as well as giving back to the community. Through workshops, socials, and collaborations with other campus organizations, we help our members develop the necessary skills to succeed in the workforce. We believe that the technical skills that we develop in the classroom must be supplemented with confidence and adaptability.\r\n"
    },
    {
        "name": "Pakistan Students Association",
        "description": "\r\n    For those who intend to better their community in times of struggle, for those who want to fight for justice, for those who want to strengthen the bonds between their fellow comrades, for those who want to be a part of a family. This is the Pakistani Students Association. Mission of this association is to learn and present real culture of Islamic Republic of Pakistan. This will not only help bringing Pakistani community together but will also bring harmony among members. This club will be real representation of Pakistan in terms of tourism, religion and culture.\r\n"
    },
    {
        "name": "Philippine American Organization (PAO)",
        "description": "\r\n    The Philippine American Organization (PAO) is dedicated to the empowerment, appreciation, and cultural awareness of Filipino culture at The City College of New York (CCNY) through introduction, dialogue, and activities. PAO provides a friendly social atmosphere that allows Filipino-American students, as well as other ethnicities, to interact and meet.\r\n"
    },
    {
        "name": "Physicians for Human Rights - Undergraduate Chapter",
        "description": "\r\n    Physicians for Human Rights (PHR) is dedicated to increasing awareness of mass atrocities and severe human rights violations around the world. PHR is a national nonprofit organization that believes in using the unique skills and credibility of health professionals to advocate for persecuted health workers, prevent torture, document mass atrocities, and hold those who violate human rights accountable. Our chapter aims to educate, advocate, and fundraise to support causes that represent the mission of PHR as we work towards a more informed, healthy, and peaceful world. Our more recent work includes hosting the 2020 PHR National Student Conference and Narcan training for undergraduate students. Our chapter’s goal is to be informed and inform others of the prevailing issues related to healthcare access and equity as well as to advocate for human rights--specifically focusing on the importance of respecting each individual’s human dignity in healthcare and life. Our PHR chapter hopes to encourage people to reach out and be involved in efforts to preserve the human rights and health experiences of people, especially those in vulnerable situations or those from underserved communities.\r\n"
    },
    {
        "name": "Pre-Dental Honor Society of CCNY",
        "description": "\r\n    Undergraduate Pre- Dental club for university students who are looking to pursue a career in dentistry.\r\n"
    },
    {
        "name": "Project Sunshine",
        "description": "\r\n    Project Sunshine Chapter at the City College of New York is an undergraduate club and an extension of the Project Sunshine national non-profit organization. Project Sunshine provides free educational, recreational, and social programs to children and families living with medical challenges.\r\n"
    },
    {
        "name": "Sci-fi Gaming and Animation",
        "description": "\r\n    The Sci-Fi, Gaming and Animation Club exists to provide CCNY students a place where science fiction, games, and animation are shared in an exciting and relaxing enviroment. These purposes will be achieved by informing and providing the CCNY community of the aspects of science fiction depicated in various forms of media (whether it is movies, TV shows, books, etc.), games (board games, card games, video games, etc.) and animation.\r\n"
    },
    {
        "name": "Sisters of The Sophie Davis School of Biomedical Education",
        "description": "\r\n    The Sisters of the Sophie Davis School of Biomedical Education (SOS) is a club created to empower women, to mold future leaders, and to support the endeavors of students both inside and outside the classroom. With a focus on medicine, and the struggles and triumphs of women of color, currently, the Sisters of the Sophie Davis School of Biomedical Education continues to expand, promoting self-esteem, integrity, respect, and academic excellence.\r\n"
    },
    {
        "name": "Society of Asian Scientists and Engineers",
        "description": "\r\n    Our club is committed to providing support to the community and to promoting educational programs for the advancement of its members. The objectives and goals of the Chapter shall be to: 1.0 Support and develop programs that provide for the advancement of Asian heritage scientists and engineers. This goal shall be implemented by: • Career Workshops • Seminars and Symposia that focus on bettering the employability of members by bolstering the soft skills of members, working on their resumes, and teaching interview skills.\r\n"
    },
    {
        "name": "Society of Automotive Engineers",
        "description": "\r\n    The Society of Automotive Engineering’s primary objective is to design, manufacture, and compete a one-person all-terrain vehicle at the International Baja competition. In the process of designing and manufacturing the vehicle, students gain professional skills that are needed in the engineering workforce. The SAE BAJA competition is a Collegiate Design Competition in which 100 top engineering schools from around the globe compete to design and build the best single person off-road vehicle. Students will also be exposed to engineering from a professional standpoint. Guidance will be given for resume and cover letters, job/ internship searching, expanding your network, and preparing students for their future endeavors as engineers.\r\n"
    },
    {
        "name": "Society of Women Engineers",
        "description": "\r\n    SWE CCNY is a professional and social network intended to help train and develop not only strong engineers, but also strong connections. Our goal is to create a safe and friendly environment to help hone the abilities we possess but also develop one's we might not!\r\n"
    },
    {
        "name": "South Asians in STEM",
        "description": "\r\n    The mission of this club is to create a friendly and social environment by aggressively promoting STEM and networking activities through many of its programs and like-minded individuals interested in mentoring students in science, technology, engineering and math at CCNY. Our goal is to expose our members to the STEM industry and nurture their interest in it early to allow a smooth transition from school into the working environment.\r\n"
    },
    {
        "name": "Student Athlete Advisory Committee",
        "description": "\r\n    A student-athlete advisory committee (SAAC) is a committee made up of student-athletes assembled to provide insight on the student-athlete experience. The SAAC offers input on the rules, regulations and policies that affect student athletes’ lives. We work alongside the CCNY athletic department to bring together athletes and to provide an engaging student athlete experience.\r\n"
    },
    {
        "name": "Student National Medical Association (SNMA) -Undergraduate Chapter",
        "description": "\r\n    The Student National Medical Association (SNMA), established in 1964, is the oldest and largest independent, student-run organization focused on the needs and concerns of black medical students in the United States. SNMA chapters are based at medical schools throughout the nation, and some colleges, implementing programs and activities locally. SNMA programs are designed to serve the health needs of underserved communities and communities of color. In addition, SNMA is dedicated both to ensuring that medical education and services are culturally sensitive to the needs of diverse populations and to increasing the number of African-American, Latino, and other students of color entering and completing medical school.\r\n"
    },
    {
        "name": "Students for Justice in Palestine",
        "description": "\r\n    The club’s main objective each semester is to inform and educate the campus community on social, racial, and political injustices in Palestine.\r\n"
    },
    {
        "name": "Students Supporting Israel",
        "description": "\r\n    Students Supporting Israel upholds the right of Israel to exist as a Jewish and democratic state. The club provides a safe space for students to express their Zionist beliefs.\r\n"
    },
    {
        "name": "Tau Epsilon Phi Fraternity, Inc.",
        "description": "\r\n    ΤΕΦ is an inclusive fraternity practicing our pillars of Friendship, Chivalry, and Service with a very active CCNY alumni association.\r\n"
    },
    {
        "name": "Tau Kappa Epsilon International Fraternity, Inc.",
        "description": "\r\n    Established on the honest convictions of Love, Charity, and Esteem, Tau Kappa Epsilon is a men’s social fraternity 121 years in the making, and over 291,00 brothers initiated internationally. The Kappa Sigma Chapter is one of the most diverse chapters in the organization, and we take pride in our mission to aid men in their mental, moral, and social development for life.\r\n"
    },
    {
        "name": "Teachers For A Better Tomorrow",
        "description": "\r\n    The Teachers for a Better Tomorrow club is an undergraduate student organization in the School of Education whose goal is to provide social and educational opportunities and activities for the benefit of CCNY students preparing to become teachers.\r\n"
    },
    {
        "name": "The American Advertising Federation Student Chapter of The City College of New York",
        "description": "\r\n    To provide and promote a better understanding of the functions of advertising and its values; to stimulate and encourage advertising professionalism through advertising education. We strive to help students discover and improve on their individual skills in the communications sector.\r\n"
    },
    {
        "name": "The American Institution of Aeronautics and Astronautics",
        "description": "\r\n    We are the American Institute of Aeronautics and Astronautics (AIAA) chapter at the City College of New York, an undergraduate club that began in 2000 with a small group of people that shared the same interest for designing and building planes. Since then, the club has expanded to include many more members and we compete yearly in AIAA’s Design/Build/Fly competition against teams all around the world. Along the way, we enhance group dynamics and learn to work together to get the best results. Here at AIAA, not only do we strive to build better aircraft, but build better future engineers.\r\n"
    },
    {
        "name": "The American Institute of Chemical Engineers",
        "description": "\r\n    The club is built around the idea of bringing chemical engineers together and create a tight community.\r\n"
    },
    {
        "name": "The Biology Club",
        "description": "\r\n    The Biology Club's mission is to provide access to information and opportunities to students both on and off campus. Increase professional networks and collaborations. Learn how to market yourself through professional development events.\r\n"
    },
    {
        "name": "The City College of New York Ice Hockey Club",
        "description": "\r\n    The purpose of The City College Ice Hockey Club is to promote diversity, govern andimprove organized collegiate and youth hockey in the local campus community and theNew York Metropolitan area by authority of The City College of New York. To fosteramong the members, supporters and Men’s and Women’s hockey teams a generalcooperative spirit; to maintain and increase interest in sports, physical fitness and thegame of hockey; to have and exercise a general care, supervision and direction over theplaying interest of the teams and players. To promote education and learning throughspeaking engagements and life lessons from under-graduate, graduate members andalumni to youth groups in New York City under the CCNY Athletics banner.\r\n"
    },
    {
        "name": "The Housekeeping Authority",
        "description": "\r\n    The Housekeeping Authority supports all students in the City College Community in providing opportunities for service and enlightenment on educational, professional, and personal enrichment services.\r\n"
    },
    {
        "name": "The Latin American Engineering Student Association Chapter of the Society of Hispanic Professional Engineers (LAESA-SHPE)",
        "description": "\r\n    The Latin American Engineering Student Association Chapter of the Society of Hispanic Professional Engineers (LAESA-SHPE) is one of the most prominent undergraduate student organizations at The City College of New York. Our mission is to be the premier facilitator of student's endeavors in the Science, Technology, Engineering, and Mathematics (STEM) fields. Throughout the years, LAESA-SHPE has been able to gather motivated students from all engineering disciplines and a diverse pool of cultural backgrounds.\r\n"
    },
    {
        "name": "The Percy Sutton SEEK Student Club",
        "description": "\r\n    The Percy Ellis Sutton SEEK Student Club is a student organization of the SEEK (Search for Education, Elevation, and Knowledge) Program at the City College that preserves the SEEK Program's rich heritage, as well as its historical, cultural, and educational importance. SEEK is a higher educational opportunity program that provides academic and financial support to students who qualify based on specific income and academic criteria. As the SEEK club, we promote diversity, equity, and inclusion to ensure all SEEK students are represented and heard. To do that, we provide a safe space and community where SEEK students feel comfortable participating in. We also create fun, but also engaging events that keep our club members active while offering helpful: academic, professional, and personal resources to help SEEK students navigate their college journey. For the countless number of times, we have had events, we have/will do our best to make them feel part of a robust family-like network of students that they can rely on for anything. Ultimately, the SEEK club serves as a support system for all SEEK students for that they will be able to enter greater social and economic mobility.\r\n"
    },
    {
        "name": "The Physics Club of CCNY",
        "description": "\r\n    The goal of The Physics club is to foster and encourage interest in Physics among the CCNY community. We aim to ease the path of students interested in majoring or minoring in physics. We also build a community among aspiring physicists in our club to help foster a synergistic collaboration and make life easier and more enjoyable for our members.\r\n"
    },
    {
        "name": "The Psychology Club",
        "description": "\r\n    The Psychology Club is a student-run organization composed of undergraduates who have an interest in the discipline of psychology, who have declared psychology as their academic major or minor, or who joined the organization as a means to further enrich their academic experience at the City College of New York.\r\n"
    },
    {
        "name": "Theta Phi Gamma",
        "description": "\r\n    Theta Phi Gamma strives to develop the greatest potential of each sister according to her individual talents, skills and personality. Theta Phi Gamma aims to help members grow even after graduating to become strong, independent and successful women, provide various resources for networking and to create a better college experience overall.\r\n"
    },
    {
        "name": "Vision Latina",
        "description": "\r\n    Vision Latina / LMSA is a CCNY club that seeks to raise awareness towards the health disparities prevalent in the Hispanic/Latino cultural community in all aspects of medicine (availability of medical care, community awareness of medical issues, graduation rate of Hispanic/Latino medical students, low rates of practicing Latino/Hispanic medical professionals, etc.). We have joined forces with a national network of Hispanic medical students and we are also the CCNY chapter of the Latino Medical Student Association (LMSA). This serves to provide our members with a large network of Latino medical students and various chapters from coast to coast. We hope to undertake a few volunteer initiatives within the surrounding Harlem community as well as work in conjunction with other Sophie Davis and CCNY clubs in educational and recreational events in this ensuing academic year.\r\n"
    },
    {
        "name": "Women in Computer Science",
        "description": "\r\n    WiCS CCNY aims to bring together women and men who support the advancement of our fellow women in computer science, in academia, and in the industry. Education plays a vital role in WiCS. We want to expose everyone from all disciplines to Computer Science, facilitate learning, and work together to solve problems. Our network connects all CCNY students to an open and diverse community. By doing so, this opens opportunities to build connections both professionally and personally.\r\n"
    },
    {
        "name": "Women in Islam",
        "description": "\r\n    The City College of New York’s Muslim Student Organization and Women in Islam’s purpose is to provide and maintain an Islamic community on campus, as well as to educate people of the message of Islam.\r\n"
    }
]